tap "aquaproj/aqua"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "modularml/packages"
tap "ryota2357/pleck-jp"
brew "libpng"
brew "xz"
brew "zstd"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "libgit2"
brew "bat"
brew "python@3.12"
brew "xorgproto"
brew "gmp"
brew "gcc"
brew "binwalk"
brew "emacs"
brew "cask"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "curl"
brew "docker", link: false
brew "docker-compose"
brew "exiftool"
brew "tesseract"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "foremost"
brew "ghostscript"
brew "git"
brew "libusb"
brew "gnupg"
brew "git-secret"
brew "git-secrets"
brew "glpk"
brew "lua"
brew "gnuplot"
brew "go"
brew "htop"
brew "libtool"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "perl"
brew "latexindent"
brew "lsd"
brew "mas"
brew "neovim"
brew "nikto"
brew "node"
brew "nodebrew"
brew "ollama", link: false
brew "openjdk"
brew "openssl@1.1"
brew "pipenv"
brew "pkg-config"
brew "pyenv"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "rbenv-gemset"
brew "ruby"
brew "rustup-init"
brew "rye"
brew "sl"
brew "stepci"
brew "tailwindcss"
brew "telnet"
brew "tesseract-lang"
brew "tmux"
brew "tnftp"
brew "tree"
brew "typst"
brew "typstyle"
brew "vim"
brew "virtualenv"
brew "volatility"
brew "watch"
brew "waybackpy"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"
brew "modularml/packages/modular"
cask "alacritty"
cask "alfred"
cask "ankerwork"
cask "arc"
cask "battery"
cask "brave-browser"
cask "burp-suite"
cask "chatgpt"
cask "chromedriver"
cask "clamxav"
cask "clip-studio-paint"
cask "cursor"
cask "deepl"
cask "devtoys"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-harano-aji"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-tex-gyre-termes-math"
cask "ghidra"
cask "gimp"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "hex-fiend"
cask "hhkb-studio"
cask "hiddenbar"
cask "iterm2"
cask "itermai"
cask "jump-desktop-connect"
cask "karabiner-elements"
cask "kindle"
cask "logitech-options"
cask "ltspice"
cask "macgpt"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "monitorcontrol"
cask "notion"
cask "ollama"
cask "opencat"
cask "pleck-jp"
cask "raspberry-pi-imager"
cask "slack"
cask "spotify"
cask "temurin"
cask "utm"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wezterm"
cask "wireshark"
cask "xquartz"
cask "zoom"
mas "CommentScreen", id: 1450950860
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Remote Desktop", id: 1295203466
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
vscode "farosystemappender constructor"
vscode "akamud.vscode-theme-onelight"
vscode "anseki.vscode-color"
vscode "astro-build.astro-vscode"
vscode "bajdzis.vscode-database"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidbabel.vscode-simpler-icons"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "ibm.output-colorizer"
vscode "inu1255.easy-snippet"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jnbt.vscode-rufo"
vscode "kevinrose.vsc-python-indent"
vscode "marp-team.marp-vscode"
vscode "maxdavidwow.remix-light"
vscode "mbessey.vscode-rufo"
vscode "mechatroner.rainbow-csv"
vscode "mgt19937.typst-preview"
vscode "mhutchie.git-graph"
vscode "modular-mojotools.vscode-mojo"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "natizyskunk.sftp"
vscode "nhoizey.gremlins"
vscode "nvarner.typst-lsp"
vscode "oderwat.indent-rainbow"
vscode "p1c2u.docker-compose"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sharat.vscode-brewfile"
vscode "shardulm94.trailing-spaces"
vscode "sumneko.lua"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vinirossa.vscode-gitandgithub-pack"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "xaver.clang-format"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
