tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mokupuro/geekhaku-cli"
tap "ryota2357/pleck-jp"

brew "bat"
brew "cask"
brew "gcc"
brew "docker"
brew "docker-compose"
brew "exa"
brew "ffmpeg"
brew "jpeg", link: true
brew "git"
brew "git-secrets"
brew "python@3.11"
brew "imagemagick"
brew "latexindent"
brew "lsd"
brew "mas"
brew "neovim"
brew "node"
brew "nodebrew"
brew "perl"
brew "pipenv"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "telnet"
brew "texlive"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "zplug"
brew "zsh"
brew "mokupuro/geekhaku-cli/geekhaku-cli"

cask "adobe-acrobat-reader"
cask "alfred"
cask "battery"
cask "brave-browser"
cask "cheatsheet"
cask "deepl"
cask "firefox-developer-edition"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "github"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "logitech-options"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "monitercontrol"
cask "pleck-jp"
cask "runcat-plugins-manager"
cask "sidekick"
cask "slack"
cask "vincelwt-chatgpt"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zoom"

mas "magnet", id: 441258766
mas "LINE", id: 539883307
mas "Microsoft Outlook", id: 985367838
mas "RunCat", id: 1429033973
mas "GoodNotes", id: 1444383602

# vim: ft=ruby
