tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "ryota2357/pleck-jp"

brew "automake"
brew "bat"
brew "cask"
brew "clang-format"
brew "cmake"
brew "gcc"
brew "docker"
brew "docker-compose"
brew "ffmpeg"
brew "jpeg", link: true
brew "git"
brew "git-secret"
brew "git-secrets"
brew "imagemagick"
brew "latexindent"
brew "lsd"
brew "mas"
brew "neovim"
brew "node"
brew "nodebrew"
brew "openssl@1.1"
brew "openssl@3"
brew "perl"
brew "pipenv"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "tailwindcss"
brew "telnet"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"

cask "alfred"
cask "ankerwork"
cask "arc"
cask "battery"
cask "brave-browser"
cask "deepl"
cask "docker"
cask "dotnet-sdk"
cask "firefox"
cask "font-fira-code"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "gimp"
cask "github"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "logitech-options"
cask "macgpt"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "monitorcontrol"
cask "opencat"
cask "pleck-jp"
cask "raspberry-pi-imager"
cask "slack"
cask "spotify"
cask "unity"
cask "unity-hub"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"

mas "magnet", id: 441258766
mas "LINE", id: 539883307
mas "Microsoft Outlook", id: 985367838
mas "RunCat", id: 1429033973
mas "GoodNotes", id: 1444383602

# vim: ft=ruby
